Repository: JanThiel/wp-decalog
Catalog: .translations/wp-plugins-decalog-stable-readme-*.po
Languages: fr_ca

source: Capture and log events on your site. View them in your dashboard and send them to logging services.
fr_ca: Capturez et enregistrez les évènements qui surviennent sur votre site. Affichez-les dans votre Tableau de bord et envoyez-les à des services d’enregistrement.

source: For a full help on WP-CLI commands in DecaLog, please <a href="https://github.com/Pierre-Lannoy/wp-decalog/blob/master/WP-CLI.md">read this guide</a>.
fr_ca: Pour obtenir une aide complète sur les commandes WP-CLI dans DecaLog, veuillez <a href="https://github.com/Pierre-Lannoy/wp-decalog/blob/master/WP-CLI.md">lire ce guide</a>.

source: <strong>DecaLog</strong> supports an extensive set of WP-CLI commands to:
fr_ca: <strong>DecaLog</strong> prend en charge un vaste ensemble de commandes WP-CLI pour :

source: It can be used in dev/debug phases or on production sites: it has nearly no resource impact on the server.
fr_ca: Il peut être utilisé dans les phases de développement et débogage ou en production : il n’a presque aucun impact sur les ressources du serveur.

source: manage listeners (list, enable, disable and auto-listening toggle) - see <code>wp help log listener</code> for details.
fr_ca: gérer les observateurs (lister, activer, désactiver et basculer l’écoute automatique) - voir <code>wp help log listener</code> pour plus de détails.

source: view available logger types (list and describe) - see <code>wp help log type</code> for details;
fr_ca: afficher les types d’enregistreurs disponibles (lister et décrire) - voir <code>wp help log type</code> pour plus de détails ;

source: manage loggers (list, start, pause, clean, purge, remove, add and set) - see <code>wp help log logger</code> for details;
fr_ca: gérer les enregistreurs (lister, démarrer, mettre en pause, nettoyer, purger, supprimer, ajouter et régler) - voir <code>wp help log logger</code> pour plus de détails ;

source: toggle on/off main settings - see <code>wp help log settings</code> for details;
fr_ca: activer ou désactiver le réglages principaux - voir <code>wp help log settings</code> pour plus de détails ;

source: send messages to running loggers - see <code>wp help log send</code> for details;
fr_ca: envoyer des messages aux enregistreurs en cours d’exécution - voir <code>wp help log send</code> pour plus de détails ;

source: display (past or current) events in console - see <code>wp help log tail</code> for details;
fr_ca: afficher les évènements (passés ou actuels) dans la console - voir <code>wp help log tail</code> pour plus de détails ;

source: to WP-CLI console.
fr_ca: à la console WP-CLI.

source: Your favorite plugin is not in this list? You want to send your logs to another service? Just <a href="https://github.com/Pierre-Lannoy/wp-decalog/issues/new/choose">tell me</a>, and I will see how to add it.
fr_ca: Votre extension préférée n’est pas dans cette liste ? Vous souhaitez envoyer vos registres d’évènements à un autre service ? Il suffit <a href="https://github.com/Pierre-Lannoy/wp-decalog/issues/new/choose">de me le dire</a>, et je verrai ce que je peux faire.

source: In addition to the events generated by your site (PHP, database, WordPress core), <strong>DecaLog</strong> logs all events from:
fr_ca: En plus des évènements générés par votre site (PHP, base de données, cœur de WordPress), <strong>DecaLog</strong> enregistre tous les évènements en provenance de :

source: This plugin may handle personally identifiable information (PII). If the GDPR or CCPA or similar regulation applies to your case, you must use the anonymization options embedded in the plugin and/or adapt your processes (consent management, security measure, treatment register, etc.).
fr_ca: Cette extension peut traiter des données à caractère personnel (DCP). Si le RGPD ou le CCPA ou un règlement similaire s’applique à votre cas, vous devez utiliser les options d’anonymisation intégrées dans l’extension et/ou adapter vos processus (gestion du consentement, mesure de sécurité, registre des traitements, etc.).

source: This plugin doesn't set any cookie in the user's browser.
fr_ca: Cette extension ne dépose pas de témoin dans le fureteur de l’utilisatrice ou de l’utilisateur.

source: This plugin, as any piece of software, is neither compliant nor non-compliant with privacy laws and regulations. It is your responsibility to use it - by activating the corresponding options or services - with respect for the personal data of your users and applicable laws.
fr_ca: Cette extension, comme tout autre logiciel, n’est ni conforme ni non conforme aux lois et règlements sur la protection de la vie privée. Il est de votre responsabilité de l’utiliser - en activant les options ou services correspondants - dans le respect des données personnelles de vos utilisatrices et utilisateurs ainsi que des lois applicables.

source: to ELK stacks like Sematext or Elastic Cloud;
fr_ca: à une pile ELK comme Sematext ou Elastic Cloud ;

source: Privacy
fr_ca: Confidentialité

source: to external logging services, like Logentries / insightOps or Loggly;
fr_ca: à des services externes d’enregistrement, comme Logentries / insightOps ou Loggly ;

source: Event Details in Internal Viewer
fr_ca: Détail de l’évènement avec la visionneuse interne

source: Internal Viewer
fr_ca: Visionneuse interne

source: Set Loggers
fr_ca: Réglage des enregistreurs

source: At this time, <strong>DecaLog</strong> can send events:
fr_ca: Actuellement, <strong>DecaLog</strong> peut envoyer des évènements :

source: <strong>DecaLog</strong> is a tool that aims to:
fr_ca: <strong>DecaLog</strong> est un outil qui vise à :

source: <strong>Capture and log events on your site. View them in your dashboard and send them to logging services.</strong>
fr_ca: <strong>Capturez et enregistrez les évènements qui surviennent sur votre site. Affichez-les dans votre Tableau de bord et envoyez-les à des services d’enregistrement.</strong>

source: to local or network storage (with file rotation);
fr_ca: à un système local ou réseau de stockage (avec rotation de fichier) ;

source: to external alerting services, like Pushover or Slack;
fr_ca: à services d’alerte externes, comme Pushover ou Slack ;

source: to external logger, like Syslog or Fluentd;
fr_ca: à des enregistreurs externes, comme Syslog ou Fluentd ;

source: to its internal logging storage and viewer;
fr_ca: à son propre système d’enregistrement et de visualisation ;

source: in the browser console (for debugging purpose);
fr_ca: dans la console de votre navigateur (pour du débogage) ;

source: by mail (alerting);
fr_ca: par courrier e-mail (alertes) ;

source: view (and filter) events recorded in the WordPress database.
fr_ca: afficher (et filtrer) les évènements enregistrés dans la base de données de WordPress.

source: record these events in the WordPress database and/or send them to external services for logging, monitoring and alerting;
fr_ca: enregistrer ces évènements dans la base de données WordPress ou les envoyer à des services externes d’enregistrement, de surveillance ou d’alerte ;

source: enrich these events with many details regarding their triggering;
fr_ca: enrichir ces évènements avec de nombreux détails concernant leur déclenchement ;

source: capture events generated by the core of WordPress and themes / plugins;
fr_ca: capturer les évènements générés par le cœur de WordPress et les thèmes et extensions ;

source: You can report bugs and suggest ideas via the <a href="https://github.com/Pierre-Lannoy/wp-decalog/issues">GitHub issue tracker</a> of the plugin.
fr_ca: Vous pouvez signaler des bogues et suggérer des améliorations via le <a href="https://github.com/Pierre-Lannoy/wp-decalog/issues">suivi d’incidents GitHub</a> de l’extension.

source: Developer's documentation can be found in the <a href="https://github.com/Pierre-Lannoy/wp-decalog">GitHub repository</a> of the plugin.
fr_ca: Vous trouverez la documentation du développeur sur le <a href="https://github.com/Pierre-Lannoy/wp-decalog">dépôt GitHub</a> de l’extension.

source: Documentation for users is provided as the form of inline help in the plugin.
fr_ca: La documentation pour les utilisatrices et utilisateurs est fournie sous forme d’aide en ligne dans l’extension.

source: Support is provided via the official <a href="https://wordpress.org/support/plugin/decalog/">WordPress page</a>.
fr_ca: L’assistance est proposée via la page officielle <a href="https://wordpress.org/support/plugin/decalog/">d’assistance</a>.

source: Yes. It is designed to work on multisite too. Network Admins can configure the plugin and have access to all events logs. Sites Admins have access to the events logs of their sites.
fr_ca: Oui. Cette extension est conçue pour fonctionner sur un multisite aussi. Les administratrices et administrateurs du réseau peuvent configurer l’extension et avoir accès à tous les registres d’évènements. Les administratrices et administrateurs de sites ont juste accès aux registres d’évènements de leurs sites.

source: You need at least <strong>WordPress 5.2</strong> and <strong>PHP 7.2</strong>.
fr_ca: Vous avez besoin d’au moins <strong>WordPress 5.2</strong> et <strong>PHP 7.2</strong>.

source: Where can I report a bug?
fr_ca: Où puis-je signaler un bogue ?

source: Where can I find documentation?
fr_ca: Où puis-je trouver la documentation ?

source: Where can I get support?
fr_ca: Où puis-je obtenir de l’aide ?

source: Can this plugin work on multisite?
fr_ca: Cette extension fonctionne-t’elle sur un multisite ?

source: What are the requirements for this plugin to work?
fr_ca: Quels sont les prérequis pour que cette extension fonctionne ?

source: Enjoy!
fr_ca: Profitez !

source: Visit 'Settings &gt; DecaLog' in the left-hand menu of your WP Admin to adjust settings.
fr_ca: Visitez « Réglages &gt; DecaLog » dans le menu gauche de votre panneau d’administration pour ajuster les paramètres.

source: Activate DecaLog from your Plugins page.
fr_ca: Activez DecaLog depuis la page des extensions.

source: Upload the <code>decalog</code> directory to your <code>/wp-content/plugins/</code> directory, using your favorite method (ftp, sftp, scp, etc...).
fr_ca: Téléversez le dossier <code>decalog</code> dans votre dossier <code>/wp-content/plugins/</code>, en utilisant votre méthode préférée (ftp, sftp, scp, etc.).

source: Download DecaLog.
fr_ca: Téléchargez DecaLog.

source: Activate DecaLog.
fr_ca: Activez DecaLog.

source: Click on the 'Install Now' button.
fr_ca: Cliquez sur le bouton « Installer maintenant ».

source: Search for 'DecaLog'.
fr_ca: Cherchez « DecaLog ».

source: Visit 'Plugins &gt; Add New'.
fr_ca: Visitez « Extensions &gt; Ajouter ».

source: Once Activated
fr_ca: Une fois activé

source: From WordPress.org
fr_ca: Depuis WordPress.org

source: From your WordPress dashboard
fr_ca: Depuis votre Tableau de bord WordPress

source: If you like this plugin or find it useful and want to thank me for the work done, please consider making a donation to <a href="https://www.laquadrature.net/en">La Quadrature Du Net</a> or the <a href="https://www.eff.org/">Electronic Frontier Foundation</a> which are advocacy groups defending the rights and freedoms of citizens on the Internet. By supporting them, you help the daily actions they perform to defend our fundamental freedoms!
fr_ca: Si vous aimez cette extension ou la trouvez utile et que vous voulez me remercier pour le travail accompli, vous pouvez faire un don à <a href="https://www.laquadrature.net/en">La Quadrature Du Net</a> ou l’<a href="https://www.eff.org/">Electronic Frontier Foundation</a> qui sont des associations de défense des droits et libertés des citoyens sur Internet. En les soutenant, vous aidez les actions quotidiennes qu’ils accomplissent pour défendre nos libertés fondamentales !

source: Anyway, I'll be glad to help you if you encounter issues when using this plugin. Just use the support section of this plugin page.
fr_ca: Dans tous les cas, je serai heureux de vous apporter mon assistance si vous rencontrez des problèmes lors de l’utilisation de cette extension. Merci de me contacter via la page support de ce site.

source: This plugin is free and provided without warranty of any kind. Use it at your own risk, I'm not responsible for any improper use of this plugin, nor for any damage it might cause to your site. Always backup all your data before installing a new plugin.
fr_ca: Cette extension est gratuite et distribuée sans aucune garantie d’aucune sorte. Son utilisation se fait à vos risques et périls, je ne saurais être tenu responsable d’aucun dommage que son utilisation pourrait causer à votre site. Pensez à toujours sauvegarder vos données avant d’installer une nouvelle extension.

source: If you're a plugins / themes developer and want to take advantage of the logging features of DecaLog, visit the <a href="https://github.com/Pierre-Lannoy/wp-decalog">GitHub repository</a> of the plugin to learn how to develop a listener for your plugins / themes. Ah, and yes, it's PSR-3 compliant ;)
fr_ca: Si vous êtes un développeur d’extensions ou thèmes et que vous souhaitez profiter des fonctionnalités d’enregistrement de DecaLog, visitez le <a href="https://github.com/Pierre-Lannoy/wp-decalog">dépôt GitHub</a> de l’extension pour découvrir comment développer un observateur pour vos extensions et thèmes. Ah oui, au fait, DecaLog est conforme PSR-3 ;)

source: <strong>DecaLog</strong> is a free and open source plugin for WordPress. It integrates many other free and open source works (as-is or modified). Please, see 'about' tab in the plugin settings to see the details.
fr_ca: <strong>DecaLog</strong> est une extension libre et open source pour WordPress. Elle intègre de nombreuses autres œuvres libres et open source (telles quelles ou modifiées). Consultez l’onglet « à propos » dans l’extension pour obtenir des détails.

source: It supports multisite logs delegation (see FAQ) and contains many features to help to protect personal information (user pseudonymization, IP obfuscation, etc.).
fr_ca: DecaLog prend en charge la délégation des registres multisites (voir FAQ) et contient de nombreuses fonctionnalités pour aider à protéger les informations personnelles (pseudonymisation de compte, obscurcissement d’adresses IP, etc.).

source: Donation
fr_ca: Don

source: Support
fr_ca: Assistance

source: Developers
fr_ca: Développeurs

source: Please, see <a href="https://github.com/Pierre-Lannoy/wp-decalog/blob/master/CHANGELOG.md">full changelog</a> on GitHub.
fr_ca: Merci de consulter le <a href="https://github.com/Pierre-Lannoy/wp-decalog/blob/master/CHANGELOG.md">journal des modifications</a> sur GitHub.
